app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 80], ["LIMIT", 1]]
---
  def show
    @brand = Brand.find(params[:id])