app/controllers/cheques_controller.rb

  def cheque

    @user = current_user
    @product = Product.find(params[:id])
    @cheque = Cheque.find_by(product: @product, user: @user)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 415], ["LIMIT", 1]]
SELECT "cheques".* FROM "cheques" WHERE "cheques"."product_id" = $1 AND "cheques"."user_id" = $2 LIMIT $3  [["product_id", 415], ["user_id", 3], ["LIMIT", 1]]