app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "brands".* FROM "brands"
---
  def show
    @user = User.find(params[:id])
    @brands = Brand.all