app/models/user.rb

  def registration_number_uniqueness
    users = User.where(registration_number: registration_number)  # users con el mismo registration number
    # [User[registration_number: 1, province: "CABA"], User[registration_number: 1, province: "Cordoba"]]
    repetido = users.any? { |user| user.national? == national? }
---
SELECT "users".* FROM "users" WHERE "users"."registration_number" = $1  [["registration_number", 1256434]]