app/views/brands/show.html.erb

          <div class="row row-cols-1 row-cols-md-3">
            <% @brand.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."brand_id" = $1  [["brand_id", 80]]